In [5]:
import pandas as pd
import numpy as np

# Sales dataset for practice
sales_data = {
    'sales_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'salesperson': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob', 'Alice', 'Charlie', 'Bob', 'Alice', 'Charlie'],
    'region': ['North', 'South', 'North', 'East', 'South', 'North', 'East', 'South', 'North', 'East'],
    'product': ['Laptop', 'Tablet', 'Phone', 'Laptop', 'Tablet', 'Phone', 'Laptop', 'Tablet', 'Phone', 'Laptop'],
    'amount': [1200, 500, 800, 1100, 450, 750, 1300, 480, 820, 1150],
    'month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar', 'Apr', 'Apr', 'May', 'May']
}

df = pd.DataFrame(sales_data)

# Department info dataset (for merging practice)
dept_data = {
    'salesperson': ['Alice', 'Bob', 'Charlie'],
    'department': ['Corporate', 'Retail', 'Corporate'],
    'hire_year': [2020, 2019, 2021]
}

dept_df = pd.DataFrame(dept_data)

print("SALES DATA:")
print(df)

SALES DATA:
   sales_id salesperson region product  amount month
0         1       Alice  North  Laptop    1200   Jan
1         2         Bob  South  Tablet     500   Jan
2         3       Alice  North   Phone     800   Feb
3         4     Charlie   East  Laptop    1100   Feb
4         5         Bob  South  Tablet     450   Mar
5         6       Alice  North   Phone     750   Mar
6         7     Charlie   East  Laptop    1300   Apr
7         8         Bob  South  Tablet     480   Apr
8         9       Alice  North   Phone     820   May
9        10     Charlie   East  Laptop    1150   May

#LEVEL 3 PRACTICE QUESTIONS
Set 1: GroupBy Mastery
Q1: What's the total sales amount by each salesperson?
Q2: What's the average sale amount by region?
Q3: Show the maximum sale amount for each product type

Set 2: Merging & Combining
Q4: Merge sales data with department info for each salesperson
Q5: Add a column showing years of experience (current year - hire_year)

Set 3: Pivot Tables & Analysis
Q6: Create a pivot table showing total sales by region and month
Q7: Make a pivot table of average sales by department and product

Set 4: Advanced Transformations
Q8: Create a new column 'sale_size': 'Large' if amount > 1000, else 'Small'
Q9: Sort the data by region (A-Z) then by amount (high to low)
Q10: Count how many sales each product has

In [11]:
#q1
total_sales = df.groupby('salesperson')['amount'].sum()
total_sales

salesperson
Alice      3570
Bob        1430
Charlie    3550
Name: amount, dtype: int64

In [13]:
#2
avg_sales = df.groupby('region')['amount'].mean()
avg_sales

region
East     1183.333333
North     892.500000
South     476.666667
Name: amount, dtype: float64

In [15]:
#3 Show the maximum sale amount for each product type
max_sale = df.groupby('product')['amount'].max()
max_sale

product
Laptop    1300
Phone      820
Tablet     500
Name: amount, dtype: int64

In [27]:
#4 Merge sales data with department info for each salesperson

combined = pd.merge(df, dept_df, on="salesperson")
combined

   sales_id salesperson region product  amount month department  hire_year
0         1       Alice  North  Laptop    1200   Jan  Corporate       2020
1         2         Bob  South  Tablet     500   Jan     Retail       2019
2         3       Alice  North   Phone     800   Feb  Corporate       2020
3         4     Charlie   East  Laptop    1100   Feb  Corporate       2021
4         5         Bob  South  Tablet     450   Mar     Retail       2019
5         6       Alice  North   Phone     750   Mar  Corporate       2020
6         7     Charlie   East  Laptop    1300   Apr  Corporate       2021
7         8         Bob  South  Tablet     480   Apr     Retail       2019
8         9       Alice  North   Phone     820   May  Corporate       2020
9        10     Charlie   East  Laptop    1150   May  Corporate       2021

In [ ]:
# Q5: Add a column showing years of experience (current year - hire_year)

exp_years =